# GlobalParamFormulaCircularChain Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GlobalParameterFailures..::..GlobalParamFormulaCircularChain Property
BuiltInFailures..::..GlobalParameterFailures Class See Also
---
A formula in a global parameter causes a circular chain of references between highlighted elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GlobalParamFormulaCircularChain { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlobalParamFormulaCircularChain As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GlobalParamFormulaCircularChain {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GlobalParameterFailures Class
Autodesk.Revit.DB Namespace